vbaena1972/FPM-200/firmware/sdkconfig.defaults
# This file was generated using idf.py save-defconfig or menuconfig [D] key. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 6.0.1 Project Minimal Configuration
#
# default:
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_EXAMPLE_USE_SPI_ETHERNET=y
CONFIG_EXAMPLE_USE_KSZ8851SNL=y
CONFIG_EXAMPLE_ETH_SPI_HOST=2
CONFIG_EXAMPLE_ETH_SPI_INT0_GPIO=14
CONFIG_EXAMPLE_ETH_SPI_PHY_RST0_GPIO=9
CONFIG_EXAMPLE_ETH_SPI_PHY_ADDR0=3
CONFIG_COMPILER_ASSERT_NDEBUG_EVALUATE=y
CONFIG_COMPILER_DISABLE_DEFAULT_ERRORS=y
CONFIG_COMPILER_ORPHAN_SECTIONS_WARNING=y
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_MEM_ALLOC_MODE_EXTERNAL=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_CRYPTO_STACK_MBEDTLS=y
# QR real de emparejamiento en la pantalla "Configurar por app" (ui_bleAppScreen).
CONFIG_LV_USE_QRCODE=y
# La memoria de objetos de LVGL va a PSRAM (allocator custom en main/lv_port_mem.c).
# Evita agotar la RAM interna al construir pantallas (crashes por OOM en config).
# CONFIG_LV_USE_CLIB_MALLOC is not set
CONFIG_LV_USE_CUSTOM_MALLOC=y
# El handler de escritura GATT (chr_access) corre en la tarea nimble_host y
# hace cJSON_Parse + appcfg_save (cJSON_Print + NVS). Con 5120 desbordaba el
# canario al guardar config desde la app. 8192 da margen para parse+save.
CONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=8192
CONFIG_BT_NIMBLE_TRANSPORT_ACL_FROM_LL_COUNT=12
CONFIG_BT_NIMBLE_EXT_SCAN=y
CONFIG_BLE_MESH=y
CONFIG_ESP32S3_REV_MIN_2=y
CONFIG_LIBC_NEWLIB=y
CONFIG_PM_SLEEP_FUNC_IN_IRAM=y
CONFIG_SPIRAM=y
# Integrar PSRAM al heap de malloc(): las allocaciones grandes caen a PSRAM y se
# libera RAM interna (antes SPIRAM_USE_CAPS_ALLOC hacia que TODO malloc fuera
# interno -> RAM interna a ~1KB, fallo de mbedtls/wifi y watchdog).
CONFIG_SPIRAM_USE_MALLOC=y
# Allocaciones < este tamano se sirven de RAM interna; >= van a PSRAM.
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=8192
# RAM interna reservada que las allocaciones PSRAM NO tocan (para DMA/drivers).
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
# Refresco/muestreo de touch LVGL a ~50 fps (antes 33 ms/30 fps): touch mas
# responsivo y animaciones de presion mas fluidas.
CONFIG_LV_DEF_REFR_PERIOD=20
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384
CONFIG_ESP_IPC_TASK_STACK_SIZE=2048
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=4
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=5
CONFIG_ESP_WIFI_STATIC_TX_BUFFER_NUM=1
CONFIG_ESP_WIFI_RX_MGMT_BUF_NUM_DEF=4
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=n
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=n
CONFIG_ESP_WIFI_MGMT_SBUF_NUM=16
CONFIG_ESP_WIFI_IRAM_OPT=n
CONFIG_ESP_WIFI_RX_IRAM_OPT=n
# CONFIG_FATFS_LFN_NONE is not set
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255
CONFIG_FATFS_USE_DYN_BUFFERS=n
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=4096
CONFIG_FREERTOS_USE_TRACE_FACILITY=y
CONFIG_FREERTOS_USE_STATS_FORMATTING_FUNCTIONS=y
CONFIG_FREERTOS_VTASKLIST_INCLUDE_COREID=y
CONFIG_FREERTOS_WATCHPOINT_END_OF_STACK=y
CONFIG_FREERTOS_IN_IRAM=y
CONFIG_HEAP_TRACING_OFF=y
CONFIG_LOG_VERSION_2=y
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=16
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=2920
CONFIG_LWIP_TCP_WND_DEFAULT=2920
CONFIG_LWIP_TCP_OOSEQ_MAX_PBUFS=4
CONFIG_MBEDTLS_THREADING_C=n
CONFIG_MBEDTLS_SSL_KEEP_PEER_CERTIFICATE=y
CONFIG_MBEDTLS_LARGE_KEY_SOFTWARE_MPI=n
# Alojar los buffers de mbedTLS (TLS IN=16KB / OUT=4KB + handshake) en PSRAM,
# no en DRAM interna. Evita agotar la RAM interna al conectar a AWS IoT, que
# dejaba sin memoria al buffer DMA del LCD y colgaba la HMI en Configuracion.
# CONFIG_MBEDTLS_INTERNAL_MEM_ALLOC is not set
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
CONFIG_ESP_PROTOCOMM_SUPPORT_SECURITY_VERSION_0=y
CONFIG_ESP_PROTOCOMM_SUPPORT_SECURITY_VERSION_1=y
CONFIG_VFS_SUPPORT_TERMIOS=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_34=y
# LVGL: usar el asignador del sistema (heap_caps de ESP) en vez del TLSF builtin
# con pool fijo de 64 KB. El builtin se fragmentaba con el churn de realloc del
# layout flex (grow_dsc en cada refresco) y entraba en BUCLE -> watchdog en
# taskLVGL (find_track_end/lv_realloc). heap_caps es robusto y no hace loop.
CONFIG_LV_USE_CLIB_MALLOC=y

CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y

CONFIG_FREERTOS_RUN_TIME_STATS_USING_ESP_TIMER=y

CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096

CONFIG_LWIP_TCPIP_TASK_STACK_SIZE=4096

CONFIG_ESP_TASK_WDT_PANIC=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_FREERTOS_HZ=1000
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y
CONFIG_ESP_COREDUMP_DATA_FORMAT_ELF=y
